app/Controllers/CarritoController.php

    public function actualizar(){
        $carritoModel = new \App\Models\CarritoModel();
        $productoModel = new \App\Models\ProductoModel();
        $cantidades = $this->request->getPost('cantidades');

        foreach ($cantidades as $carritoId => $nuevaCantidad) {
            $item = $carritoModel->find($carritoId);
            if ($item) {
                $producto = $productoModel->find($item['producto_id']);
                if ($producto && $nuevaCantidad > $producto['stock']) {
                    return redirect()->back()->with('mensaje', 'Stock insuficiente para ' . esc($producto['nombre']));
                }
                $carritoModel->update($carritoId, ['cantidad' => $nuevaCantidad]);
---
SELECT *
FROM `carrito`
WHERE `carrito`.`id` = 46
SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'
UPDATE `carrito` SET `cantidad` = '10'
WHERE `carrito`.`id` IN (46)