app/Controllers/ProductoController.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '4'
UPDATE `productos` SET `nombre` = 'FARMAVITA HD DEFINING GLOSSY WAX 100ML LIFESTYLE', `descripcion` = 'HD DEFINING GLOSSY WAX FARMAVITA 100ML LIFESTYLE\r\nEfecto brillo de cera con Farmavita, da un brillo brillante a los mechones de cabello y los hace expresivos.\r\nLa cera brillante da un efecto radiante, fijación fuerte y es ideal para separar el cabello en mechones. La deliciosa composición aromática de mora, grosella negra y aceite de coco fortalece el cabello, y usted y todos los que lo rodean tienen un encanto banal.\r\n\r\nPropiedades:\r\n\r\nAcabado brillante y definición.\r\nEfecto húmedo icónico.\r\nFácil de usar y moldear.\r\nFórmula vegana.', `precio` = '40732.000', `stock` = '0', `imagen` = 'cera glossy_wx.jpg', `categoria_id` = '3', `estado` = 1
WHERE `productos`.`id` IN ('4')
---
    public function activar($id){
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($id);

        if ($producto) {
            $producto['estado'] = 1; // Cambia el estado a activo
            $productoModel->update($id, $producto);

SELECT *
FROM `productos`
WHERE `estado` = 1
---
    public function catalogo(){
        $productoModel = new ProductoModel();
        $productos = $productoModel->where('estado', 1)->findAll(); // Solo productos activos