app/Controllers/VentaController.php

   public function index(){
    $ventaModel = new VentaModel();
    $detalleModel = new VentaDetalleModel();
    $usuarioModel = new UsuarioModel();
    $usuarioId = session()->get('id');
    $usuarioRol = session()->get('rol');

    if ($usuarioRol === 'admin') {
        $data['ventas'] = $ventaModel->obtenerTodasLasVentasConUsuario();
        $data['clientes'] = $usuarioModel->findAll();

        // Agregar detalles de productos a cada venta
        foreach ($data['ventas'] as &$venta) {
            $venta['detalles'] = $detalleModel
                ->select('detalle_venta.*, productos.nombre as producto_nombre, productos.precio')
                ->join('productos', 'productos.id = detalle_venta.producto_id')
                ->where('venta_id', $venta['id'])
                ->findAll();
        }

        return view('ventas/gestion_ventas', $data);
    } else {

             $ventas = $ventaModel->where('usuario_id', $usuarioId)->findAll();

            foreach ($ventas as &$venta) {
                $venta['detalles'] = $detalleModel
                    ->select('detalle_venta.*, productos.nombre as producto_nombre')
                    ->join('productos', 'productos.id = detalle_venta.producto_id')
                    ->where('venta_id', $venta['id'])
                    ->findAll();
---
SELECT `detalle_venta`.*, `productos`.`nombre` as `producto_nombre`
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id` = `detalle_venta`.`producto_id`
WHERE `venta_id` = '1'

   public function gestion_ventas(){
        // Solo permite acceso a admins
        if (!session()->get('logueado') || session()->get('rol') !== 'admin') {
            return redirect()->to('/')->with('error', 'Acceso no autorizado.');
        }
        $ventaModel = new \App\Models\VentaModel();
        $detalleModel = new \App\Models\VentaDetalleModel();
        $usuarioModel = new \App\Models\UsuarioModel();
        $filtros = [];
        $ventas = $ventaModel->obtenerTodasLasVentasConUsuario($filtros);
        $clientes = $usuarioModel->findAll();

        // Agregar detalles de productos a cada venta
        foreach ($ventas as &$venta) {
            $venta['detalles'] = $detalleModel
                ->select('detalle_venta.*, productos.nombre as producto_nombre, productos.precio')
                ->join('productos', 'productos.id = detalle_venta.producto_id')
                ->where('venta_id', $venta['id'])
                ->findAll();
---
SELECT *
FROM `usuarios`
SELECT `detalle_venta`.*, `productos`.`nombre` as `producto_nombre`, `productos`.`precio`
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id` = `detalle_venta`.`producto_id`
WHERE `venta_id` = '1'

    public function ticket($ventaId){
        $ventaModel = new \App\Models\VentaModel();
        $detalleModel = new \App\Models\VentaDetalleModel();
        $usuarioModel = new \App\Models\UsuarioModel();

        $venta = $ventaModel->find($ventaId);
        $detalles = $detalleModel
            ->select('detalle_venta.*, productos.nombre as producto_nombre, productos.precio')
            ->join('productos', 'productos.id = detalle_venta.producto_id')
            ->where('venta_id', $ventaId)
            ->findAll();
---
SELECT *
FROM `ventas`
WHERE `ventas`.`id` = '1'
SELECT `detalle_venta`.*, `productos`.`nombre` as `producto_nombre`, `productos`.`precio`
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id` = `detalle_venta`.`producto_id`
WHERE `venta_id` = '1'