app/Models/CarritoModel.php

SELECT *
FROM `carrito`
WHERE `usuario_id` = '2'
---
    public function obtenerCarritoPorUsuario($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)->findAll();

SELECT *
FROM `carrito`
WHERE `usuario_id` = '4'
AND `producto_id` = '4'
 LIMIT 1
---
    public function productoEnCarrito($usuarioId, $productoId)
    {
        return $this->where([
            'usuario_id' => $usuarioId,
            'producto_id' => $productoId
        ])->first();

INSERT INTO `carrito` (`usuario_id`, `session_id`, `producto_id`, `cantidad`) VALUES ('4', NULL, '4', '1')
---
    public function agregarProducto($data)
    {
        //actualizar cantidad si el producto ya existe en el carrito
        $registro = $this
        -> where('usuario_id', $data['usuario_id'])
        -> where('producto_id', $data['producto_id'])
        -> first();

        if($registro){
            $nuevaCantidad = $registro['cantidad'] + $data['cantidad'];
            return $this->update($registro['id'], ['cantidad' => $nuevaCantidad]);
        }   else{
            return $this->insert($data);