app/Models/CategoriaModel.php

SELECT *
FROM `categoria`
ORDER BY `nombre` ASC
---
    public function obtenerCategorias(){
        return $this->orderBy('nombre', 'ASC')->findAll();