app/Models/FavoritoModel.php

SELECT `favoritos`.*, `productos`.`nombre` as `producto_nombre`, `productos`.`imagen`, `productos`.`precio`, `productos`.`stock`
FROM `favoritos`
JOIN `productos` ON `productos`.`id` = `favoritos`.`producto_id`
WHERE `favoritos`.`usuario_id` = '2'
---
    public function obtenerFavoritosPorUsuario($usuarioId)
    {
        return $this->select('productos.id as producto_id, productos.nombre as producto_nombre, productos.precio, productos.imagen')
                    ->join('productos', 'productos.id = favoritos.producto_id')
                    ->where('favoritos.usuario_id', $usuarioId)
                    ->findAll();