app/Models/ProductoModel.php

    public function guardar(){
        $productoModel = new ProductoModel();

        $data = [
            'nombre'       => $this->request->getPost('nombre'),
            'descripcion'  => $this->request->getPost('descripcion'),
            'precio'       => $this->request->getPost('precio'),
            'stock'        => $this->request->getPost('stock'),
            'imagen'       => $this->request->getPost('imagen'),
            'categoria_id' => $this->request->getPost('categoria_id')
        ];
        // Insertar producto
        $productoModel->crearProducto($data);

        return redirect()->to('/productos')->with('mensaje', 'Producto creado exitosamente.');
---
SELECT *
FROM `productos`