app/Models/ProductoModel.php

    public function obtenerProductoId($id){
        return $this->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'