app/Models/UsuarioModel.php

    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'gonzalezbillordoabel@gmail.com'
 LIMIT 1