app/Models/VentaModel.php

    public function obtenerVentasPorUsuario($filtros = []){
            $builder = $this->db->table('ventas')
            ->select('ventas.*, usuarios.nombre as cliente_nombre, usuarios.apellido as cliente_apellido')
            ->join('usuarios', 'usuarios.id = ventas.usuario_id');

        if (!empty($filtros['fecha_inicio'])) {
            $builder->where('ventas.fecha >=', $filtros['fecha_inicio']);
        }
        if (!empty($filtros['fecha_fin'])) {
            $builder->where('ventas.fecha <=', $filtros['fecha_fin']);
        }
        if (!empty($filtros['cliente_id'])) {
            $builder->where('ventas.usuario_id', $filtros['cliente_id']);
        }

        return $builder->get()->getResultArray();
---
SELECT `ventas`.*, `usuarios`.`nombre` as `cliente_nombre`, `usuarios`.`apellido` as `cliente_apellido`
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id` = `ventas`.`usuario_id`

    public function obtenerTodasLasVentasConUsuario($filtros = []){
        $builder = $this->db->table('ventas')
            ->select('ventas.*, usuarios.nombre as cliente_nombre, usuarios.apellido as cliente_apellido')
            ->join('usuarios', 'usuarios.id = ventas.usuario_id');

        if (!empty($filtros['fecha_inicio'])) {
            $builder->where('ventas.fecha >=', $filtros['fecha_inicio']);
        }
        if (!empty($filtros['fecha_fin'])) {
            $builder->where('ventas.fecha <=', $filtros['fecha_fin']);
        }
        if (!empty($filtros['cliente_id'])) {
            $builder->where('ventas.usuario_id', $filtros['cliente_id']);
        }

        return $builder->get()->getResultArray();
---
SELECT `ventas`.*, `usuarios`.`nombre` as `cliente_nombre`, `usuarios`.`apellido` as `cliente_apellido`
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id` = `ventas`.`usuario_id`